t = 0:1 / 32000:1;     % 1秒を1/32000に分割

Y1 = 0.19*sin(2*pi()* 1040*t);           % 正弦波の生成 
Y2 = 0.09*sin(2*pi()* 520*t);           % 正弦波の生成
Y3 = 0.08*sin(2*pi()* 780*t);           % 正弦波の生成
Y4 = 0.08*sin(2*pi()*1300*t);           % 正弦波の生成
Y5 = 0.07*sin(2*pi()* 260*t);           % 正弦波の生成
Y6 = 0.07*sin(2*pi()*1560*t);           % 正弦波の生成

Y = horzcat(Y1, Y2, Y3, Y4 ,Y5 ,Y6);    % 時間軸で連結
    
sound(Y, 32000)    % 鳴り終わるまで7秒待つ
pause(7)
Y = Y1 + Y2 + Y3 + Y4 + Y5;    % 正弦波の合成
sound(Y, 32000);    % ？の音
plot(t, Y);                             % 正弦波をプロット
xlabel('time','FontSize',12);           % X軸ラベルの設定
xlim([0 0.01]);                         % X軸ラベルの範囲
ylabel('amplitude','FontSize',12);      % Y軸ラベルの設定
ylim([-2.0 2.0]);                       % Y軸ラベルの範囲